app/controllers/admins/categories_controller.rb

INSERT INTO `categories` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Mobile', 'All Mobile', '2024-03-20 08:54:22.226918', '2024-03-20 08:54:22.226918')
---
  def create
    @category = Category.new(category_params)

    if @category.save