app/controllers/admins/dashboard_controller.rb

  def index
    @categories = Category.all.count
    @products = Product.all.count
    @orders = Order.all
    @total_revenew = @orders.includes(:product)
---
SELECT COUNT(*) FROM `categories`
SELECT COUNT(*) FROM `products`
SELECT `orders`.* FROM `orders`
SELECT COUNT(*) FROM `orders`