app/controllers/admins/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    @orders = Order.includes(:customer, :product).all