app/controllers/admins/products_controller.rb

SELECT `categories`.* FROM `categories`
---
  def new
    @product = Product.new
    @categories = Category.all

INSERT INTO `products` (`name`, `purchase_price`, `sell_price`, `category_id`, `created_at`, `updated_at`) VALUES ('I phone 15pro', 100000.0, 120000.0, 1, '2024-03-20 08:54:48.996020', '2024-03-20 08:54:48.996020')
---
  def create
    @product = Product.new(product_params)

    if @product.save